# Built In Failures Sub Region Failures Sub Division Offset Invalid Property

Source: https://www.revitapidocs.com/2026/688faac3-b3be-b837-b272-e3d0e5d5185b.htm

---

| Built In Failures Sub Region Failures Sub Division Offset Invalid Property |
| --- |

Sub\-division's offset must be less than the thickness of its type.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId SubDivisionOffsetInvalid { get; }
```

```
Public Shared ReadOnly Property SubDivisionOffsetInvalid As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ SubDivisionOffsetInvalid {
	FailureDefinitionId^ get ();
}
```

```
static member SubDivisionOffsetInvalid : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures SubRegionFailures Class Autodesk.Revit.DB Namespace